latex_pgfplots.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-09-24 Sat 19:32 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>LaTeX - Pgfplots</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shaka Xi" />
</head>
<body>
<div id="content">
<h1 class="title">LaTeX - Pgfplots</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Introduction</a></li>
<li><a href="#orgheadline2">2. Installation</a></li>
<li><a href="#orgheadline6">3. Usage</a>
<ul>
<li><a href="#orgheadline3">3.1. <code>AXIS-TYPE</code></a></li>
<li><a href="#orgheadline4">3.2. <code>FORMULA</code></a></li>
<li><a href="#orgheadline5">3.3. Options</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
<i>Pgfplots</i> is an excellent <i>LaTeX</i> package to plot high quality graphs. This post just summaries its basic usages.
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Installation</h2>
<div class="outline-text-2" id="text-2">
<p>
Pgfplots is a built-in package in the <a href="http://tug.org">texlive</a>. As long as texlive is ready, pgfplots is out-of-the-box.
</p>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">3</span> Usage</h2>
<div class="outline-text-2" id="text-3">
<p>
Pgfplots depends on <a href="./latex_pgf_tikz.html">pgf/tikz</a>, and the statements are encapsulated in the environment of <i>tikzpicture</i>. The basic plot commands are <code>\addplot</code> and <code>\addplot3</code> for 2D or 3D plot purpose, respectively. It should be noticed that each of them has a variant, i.e. <code>\addplot+</code> and <code>\addplot3+</code>. <code>\addplot/\addplot3</code> uses the provided local options only, while <code>\addplot+/\addplot3+</code> adopts both the global and local options.
</p>

<p>
Templates for pgfplots usage can be presented as follows.
</p>
<div class="org-src-container">

<pre class="src src-latex"><span style="color: #a020f0;">\usepackage</span>{<span style="color: #0000ff;">pgfplots</span>}
<span style="color: #696969;">\pgfplotsset</span>{GLOBAL-OPTIONS}
...
<span style="color: #b22222;">% </span><span style="color: #b22222;">For single curve plot</span>
<span style="color: #a020f0;">\begin</span>{<span style="color: #0000ff;">tikzpicture</span>}
  <span style="color: #a020f0;">\begin</span>{<span style="color: #0000ff;">AXIS-TYPE</span>}[AXIS-OPTIONS]
  <span style="color: #696969;">\addplot/\addplot3</span>[PLOT-OPTIONS] {FORMULA};
  <span style="color: #696969;">\legend</span>{LABEL};
  <span style="color: #a020f0;">\end</span>{<span style="color: #0000ff;">AXIS-TYPE</span>}
<span style="color: #a020f0;">\end</span>{<span style="color: #0000ff;">tikzpicture</span>}

<span style="color: #b22222;">% </span><span style="color: #b22222;">For multi-curve plot</span>
<span style="color: #a020f0;">\begin</span>{<span style="color: #0000ff;">tikzpicture</span>}
  <span style="color: #a020f0;">\begin</span>{<span style="color: #0000ff;">AXIS-TYPE</span>}[AXIS-OPTIONS]
  <span style="color: #696969;">\addplot/\addplot3</span>[PLOT-OPTIONS] {FORMULA1};
  <span style="color: #696969;">\addlegendentry</span>{LABEL1};
  <span style="color: #696969;">\node</span> at (AXIS-TYPE cs:x1,y1) {TEXT}; <span style="color: #b22222;">% Annotation for the curve.</span>

  <span style="color: #696969;">\addplot/\addplot3</span>[PLOT-OPTIONS] {FORMULA2};
  <span style="color: #696969;">\addlegendentry</span>{LABEL2};
  ...
  <span style="color: #a020f0;">\end</span>{<span style="color: #0000ff;">AXIS-TYPE</span>}
<span style="color: #a020f0;">\end</span>{<span style="color: #0000ff;">tikzpicture</span>}
</pre>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">3.1</span> <code>AXIS-TYPE</code></h3>
<div class="outline-text-3" id="text-3-1">
<p>
The candidate values are <code>axis/semilogxaxis/semilogyaxis/loglogaxis</code>.
</p>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">3.2</span> <code>FORMULA</code></h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>plain function<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>, e.g.</li>
</ul>
<div class="org-src-container">

<pre class="src src-latex"><span style="color: #696969;">\addplot</span> {f(x)};
</pre>
</div>
<ul class="org-ul">
<li>parameter function, e.g.</li>
</ul>
<div class="org-src-container">

<pre class="src src-latex"><span style="color: #696969;">\addplot</span> ({x(t)}, {y(t)});
</pre>
</div>
<ul class="org-ul">
<li>coordinates, e.g.</li>
</ul>
<div class="org-src-container">

<pre class="src src-latex"><span style="color: #696969;">\addplot</span> coordinates{(x1,y1)(x2,y2)...(xn,yn)}
</pre>
</div>
<ul class="org-ul">
<li>data in a file, e.g.</li>
</ul>
<div class="org-src-container">

<pre class="src src-latex"><span style="color: #696969;">\addplot</span> table [x = COLUMN1, y = COLUMN2]{DATA_FILE};
</pre>
</div>
<p>
with the content of <code>DATA_FILE</code> as below.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">COLUMN1</td>
<td class="org-left">COLUMN2</td>
<td class="org-left">COLUMN3</td>
</tr>

<tr>
<td class="org-left">a1</td>
<td class="org-left">b1</td>
<td class="org-left">c1</td>
</tr>

<tr>
<td class="org-left">a2</td>
<td class="org-left">b2</td>
<td class="org-left">c2</td>
</tr>

<tr>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#x2026;</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>shade a region, e.g.</li>
</ul>
<div class="org-src-container">

<pre class="src src-latex"><span style="color: #696969;">\addplot</span> [...] {...} <span style="color: #696969;">\closedcycle</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">3.3</span> Options</h3>
<div class="outline-text-3" id="text-3-3">
<p>
<code>AXIS-OPTIONS</code> and <code>PLOT-OPTIONS</code> are basically the same, and the latter overrides the former.
</p>
<ul class="org-ul">
<li><code>title={TITLE}</code></li>
<li><code>domain=START: END</code> specifies the range of the variable \(x\).</li>
<li><code>blue/red/brown/green/cyan/magenta/yellow/black/gray/white/darkgray/lightgray/lime/olive/orange/pink/purple/teal/violet</code>. can be mixed by <code>COLOR1!PERCENTAGE!COLOR2</code>.</li>
<li><code>xlabel/ylabel={LABEL}</code></li>
<li><code>xtick/ytick={START, START+DELTA, ..., END}</code> separates the ticks between <code>START</code> and <code>END</code> with step length <code>DELTA</code>.</li>
<li><code>xticklabels/yticklabels={a,b,c,...}</code></li>
<li><code>axis equal image</code> equally scales the axes, and trims the width or height to suit.</li>
<li><code>axis lines=box/left/middle/center/right/none</code><sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup> specified the way the axes are drawn, e.g. <code>middle</code> make the axes intersect at the origin.</li>
<li><code>xmajorgrids/ymajorgrids=true/false</code> enables/disables grid lines at the tick positions on the x/y axis.</li>
<li><code>grid style=solid/dashed</code></li>
<li><code>legend pos=north/south west/east or outer north east</code></li>
<li><code>xmin/xmax/ymin/ymax=BOUND</code></li>
<li><code>grid</code></li>
<li><code>thick</code></li>
<li><code>solid/dashed/dotted/dashdotted/dashdotdotted</code></li>
<li><code>samples=SAMPLE_NUMBER</code> defines the number of points in the <code>domain</code>.</li>
<li><code>smooth</code> is an alternative to <code>samples</code>, which makes a smooth curves between data points.</li>
<li><code>mark=*/x/+/|/o/asterisk/star/10-pointed star/oplus/oplus*/otimes/otimes*/square/square*/triangle/triangle*/diamond/halfdiamond*/halfsquare*/right*/left*/halfcircle/halfcircle*/pentagon/pentagon*/cubes</code><sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup></li>
<li><code>no marks</code></li>
<li><code>mark repeat=N</code> marks the data points every <code>N</code> ones instead of every one.</li>
<li><code>only marks</code> hides the line joining the data points.</li>
<li><code>opacity=FRACTION</code> makes something not transparent, e.g. <code>fill opacity=0.6</code>.</li>
</ul>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Transformation from radian to degree, i.e. <code>deg()</code>, is needed for trigonometric functions, which accepts degree only.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
The default value is <code>box</code>.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
Usually <code>\usetikzlibrary{plotmarks}</code> is needed. <code>cubes</code> is only for 3D plots.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Shaka Xi</p>
<p class="date">Created: 2016-09-24 Sat 19:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
